# 전시회 입장 프로그램

# 다음 조건에 맞는 전시회 입장 프로그램을 작성하시오.

# 프로그램 시작 파일 이름은 main.py로 한다.
# __main__ 값을 이용하여 프로그램의 시작점을 지정한다.
# 프로그램 실행 후, 관람객의 이름, 나이, 관람할 전시회명을 입력받아 입장 가능 여부를 출력한다.
# 입력과 출력은 반복할 수 있어야 한다.
# 첫 번째 입력값으로 영문자 X 또는 x를 입력하면 프로그램이 종료된다.
# 전시회명, 입장료, 제한 연령은 2차원 리스트 exhibit에 저장한다.
# 입력한 값은 딕셔너리 client에 저장하고, 키 값은 이름으로 한다.
# exhibit_info() 함수를 작성하여 전시회명에 따라 입장료와 제한 연령을 찾도록 한다.
# 평가 요소에 해당하는 부분에는 정확한 주석문을 작성한다.

# ------------------------------------------------------------------------------
# 서1-5. 전시회명, 입장료, 제한 연령을 리스트에 저장(리스트 변수명: exhibit)
# ------------------------------------------------------------------------------

e1_name = "공룡 특별전"
e1_price = 12000
e1_min_age = 0

e2_name = "우주 탐험전"
e2_price = 15000
e2_min_age = 8

e3_name = "스릴 미로전"
e3_price = 13000
e3_min_age = 15

e4_name = "미디어 아트전"
e4_price = 14000
e4_min_age = 12

e5_name = "과학 실험전"
e5_price = 11000
e5_min_age = 10

# ------------------------------------------------------------------------------
# 이 아래에 코드를 작성하시오.
# ------------------------------------------------------------------------------
# [서1-5] 전시회명, 입장료, 제한 연령을 2차원 리스트 exhibit에 저장하시오.
# [서1-6] 입력값을 딕셔너리 client에 저장하시오. (키 값: 이름)
# [서1-7] 전시회명에 따라 입장료와 제한 연령을 찾는 함수 exhibit_info()를 작성하시오.
# [서1-4] 프로그램 실행 후 입력과 출력을 반복하고, 첫 번째 입력값이 X 또는 x이면 종료되도록 하시오.
# [서1-3] 평가 요소에 해당하는 부분에 주석을 작성하시오.
# [서1-2] main.py 파일에서 프로그램이 시작되도록 작성하시오.